
## Plan Result




<pre><code>Plan: 7 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.rd_prd_storage_account_name
  * azurerm_key_vault_secret.rd_prd_storage_account_primary_key
  * azurerm_key_vault_secret.rd_prd_storageaccount_id
  * azurerm_storage_container.professional_data_service_archive_container
  * azurerm_storage_container.professional_data_service_container
  * module.storage_account_rd_professional.azurerm_storage_account.storage_account
  * module.storage_account_rd_professional.random_string.storage_account_random_string
* Update
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage_account.azurerm_storage_account.storage_account
  * module.storage_account_rd_commondata.azurerm_storage_account.storage_account
  * module.storage_account_rd_location.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.rd_prd_storage_account_name will be created
  + resource "azurerm_key_vault_secret" "rd_prd_storage_account_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "rd-prd-storage-account-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.rd_prd_storage_account_primary_key will be created
  + resource "azurerm_key_vault_secret" "rd_prd_storage_account_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "rd-prd-storage-account-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.rd_prd_storageaccount_id will be created
  + resource "azurerm_key_vault_secret" "rd_prd_storageaccount_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "rd-prd-storage-account-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#referencedata"
          - "Team Name"    = "ReferenceData"
          - "application"  = "referencedata"
          - "builtFrom"    = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea" = "CFT"
          - "environment"  = "aat"
          - "lastUpdated"  = "2023-04-12T09:00:58Z"
          - "managedBy"    = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_storage_container.professional_data_service_archive_container will be created
  + resource "azurerm_storage_container" "professional_data_service_archive_container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "rd-prd-data-archive"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "rdcommondataaat"
    }

  # azurerm_storage_container.professional_data_service_container will be created
  + resource "azurerm_storage_container" "professional_data_service_container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "rd-prd-data"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "rdcommondataaat"
    }

  # module.rd_key_vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                       = "rd-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdaat"
        name                              = "rdaat"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (6 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "137.220.76.49",
              - "140.228.56.231",
              - "149.22.215.38",
              - "149.86.28.88",
              - "151.224.225.87",
              - "151.227.71.148",
              - "161.69.71.25",
              - "2.120.222.201",
              - "2.126.58.165",
              - "2.220.167.28",
              - "2.220.68.101",
              - "5.64.143.58",
              - "5.68.49.84",
              - "51.183.100.140",
              - "51.241.81.73",
              - "77.102.65.103",
              - "77.103.1.170",
              - "77.99.82.120",
              - "82.129.52.156",
              - "82.25.248.223",
              - "82.36.147.62",
              - "84.9.208.232",
              - "86.136.183.3",
              - "87.80.23.26",
              - "90.213.192.209",
              - "94.2.157.211",
            ]
            # (3 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.storage_account_rd_commondata.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat"
        name                              = "rdcommondataaat"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (6 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "140.228.42.55",
              - "151.227.71.148",
              - "161.69.71.25",
              - "5.68.49.84",
              - "77.102.65.103",
              - "77.103.1.170",
              - "82.23.163.176",
              - "84.9.208.232",
              - "86.161.73.177",
              - "86.184.235.94",
              - "86.184.236.13",
              - "92.2.219.160",
            ]
            # (3 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_location.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdlocationaat"
        name                              = "rdlocationaat"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (6 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "38.242.190.129",
              - "77.103.1.170",
              - "82.23.163.176",
              - "84.9.208.232",
              - "86.149.241.74",
              - "86.161.73.177",
              - "86.184.236.13",
              - "89.40.212.39",
              - "90.213.192.209",
              - "90.217.226.92",
            ]
            # (3 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_professional.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "rdcommondataaat"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rd-aat"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "Team Contact"        = "#referencedata"
          + "application"         = "reference-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "staging"
          + "managedBy"           = "Reference Data"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/rdo-hub-sftp-prod/providers/Microsoft.Network/virtualNetworks/rdo-sftp-vnet/subnets/rdo-sftp-private",
              + "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/rdo-hub-sftp-prod/providers/Microsoft.Network/virtualNetworks/rdo-sftp-vnet/subnets/rdo-sftp-public",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas",
              + "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00",
              + "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01",
            ]
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.storage_account_rd_professional.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 7 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":163,"Program":"tfcmt","SHA1":"","Vars":{}} -->